#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/flcdrg/terraform-appgw/runs/run-M7YK7vBwimwdHtV7

Waiting for the plan to start...

Terraform v1.12.2
on linux_amd64
Initializing plugins and modules...
random_string.storage_suffix: Refreshing state... [id=0ug]
data.azurerm_resource_group.rg: Refreshing...
data.azurerm_resource_group.rg: Refresh complete after 2s [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-appgw-australiaeast]
azurerm_storage_account.storage: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-appgw-australiaeast/providers/Microsoft.Storage/storageAccounts/sttfappgwaue0ug]
azurerm_storage_account_static_website.website: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-appgw-australiaeast/providers/Microsoft.Storage/storageAccounts/sttfappgwaue0ug]
azurerm_storage_account.storage: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_application_gateway.network will be created
  + resource "azurerm_application_gateway" "network" {
      + id                          = (known after apply)
      + location                    = "australiaeast"
      + name                        = "agw-terraform-appgw-australiaeast"
      + private_endpoint_connection = (known after apply)
      + resource_group_name         = "rg-terraform-appgw-australiaeast"

      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "vnet-terraform-appgw-australiaeast-beap"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "vnet-terraform-appgw-australiaeast-be-htst"
          + path                                = "/path1/"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + protocol                            = "Http"
          + request_timeout                     = 60
          + trusted_root_certificate_names      = []
            # (3 unchanged attributes hidden)
        }

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "vnet-terraform-appgw-australiaeast-feip"
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "Dynamic"
          + private_link_configuration_id = (known after apply)
          + public_ip_address_id          = (known after apply)
        }

      + frontend_port {
          + id   = (known after apply)
          + name = "vnet-terraform-appgw-australiaeast-feport"
          + port = 80
        }

      + gateway_ip_configuration {
          + id        = (known after apply)
          + name      = "my-gateway-ip-configuration"
          + subnet_id = (known after apply)
        }

      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "vnet-terraform-appgw-australiaeast-feip"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "vnet-terraform-appgw-australiaeast-feport"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "vnet-terraform-appgw-australiaeast-httplstn"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_profile_id                 = (known after apply)
            # (4 unchanged attributes hidden)
        }

      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "vnet-terraform-appgw-australiaeast-beap"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "vnet-terraform-appgw-australiaeast-be-htst"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "vnet-terraform-appgw-australiaeast-httplstn"
          + id                          = (known after apply)
          + name                        = "vnet-terraform-appgw-australiaeast-rqrt"
          + priority                    = 9
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }

      + sku {
          + capacity = 2
          + name     = "Standard_v2"
          + tier     = "Standard_v2"
        }

      + ssl_policy (known after apply)
    }

  # azurerm_public_ip.ip will be created
  + resource "azurerm_public_ip" "ip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "australiaeast"
      + name                    = "pip-terraform-appgw-australiaeast"
      + resource_group_name     = "rg-terraform-appgw-australiaeast"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # azurerm_subnet.subnet will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                              = [
          + "10.254.0.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "subnet-terraform-appgw-australiaeast"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-terraform-appgw-australiaeast"
      + virtual_network_name                          = "vnet-terraform-appgw-australiaeast"
    }

  # azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space                  = [
          + "10.254.0.0/16",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "australiaeast"
      + name                           = "vnet-terraform-appgw-australiaeast"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "rg-terraform-appgw-australiaeast"
      + subnet                         = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 4 estimated
           $0.0/mo +$0.0

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @flcdrg, Action: `pull_request`*